КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ДФ_Титул2/КонтурЛогистика_ДФ_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ДФ_Титул2</name>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфФт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПФт</name>
    <comment>Электронная подпись файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ДФ</name>
    <comment>Выдается ГИС ЭПД Уникальный идентификатор документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛистНомер</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛистДата</name>
    <comment>необязательное поле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛистСрокДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Прицепы</name>
    <attributes>
      <name>Прицеп</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВодители</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛистНомер</name>
      <comment>необязательное поле</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛистДата</name>
      <comment>необязательное поле</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛистСрокДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ДФ_Титул2/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроверкаОтвета", РежимПроверкиОтвета);
	
	ОбновитьДанныеФормы();
	
	Если ЗначениеЗаполнено(Объект.Титул1) Тогда 
		Элементы.Титул1.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Титул1.Гиперссылка = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
	КонецЕсли;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	
	// TODO
	//ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	//Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	
	//Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;	
	//Элементы.ПерезаполнитьПоДокОснованию.Видимость = НЕ ЭтоВходящий И ЕстьДокУчСист;
	
	Элементы.ПользовательПодписант.Видимость = НЕ ЭтоВходящий;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, 
		Объект.ДокументОснование,
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, 
		ТекущийСтатус);
		
	СоставительТ1 	= Объект.Титул1.Составитель;
	//НаимЭкСубСостТ1 = Объект.Титул1.НаимЭкСубСост;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьДанныеФормы();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
			
	// причина отказа в подписи 
	
	Элементы.ОтказатьВПриемеЗаявки.Видимость 	= ЭтоЧерновик;
	Элементы.ЕстьОтказВПриеме.Видимость 		= (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;	
	Элементы.ПричинаОтказаВПриеме.Видимость 	= Объект.ЕстьОтказВПодписи;
	
	Элементы.ПричинаОтказаВПриеме.ТолькоПросмотр = ЭтоВходящий Или Не ЭтоЧерновик;
	
	// режим проверки
	Элементы.ГруппаОтказВПриеме.Видимость 				= Не РежимПроверкиОтвета;
	Элементы.ГруппаКоманднаяПанельПроверка.Видимость 	= РежимПроверкиОтвета;
	Элементы.ГруппаКоманднаяПанельНеПроверка.Видимость 	= Не РежимПроверкиОтвета;
	
	ЭтаФорма.ТолькоПросмотр = РежимПроверкиОтвета;
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ДФ_Титул2.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура СвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()

	Если ШапкаНаОтдельнойЗакладке Тогда

		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;

		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;

		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;

	Иначе

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()

	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаМестоположение,
															   Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаМестоположение,
															   Элементы.ГруппаШапкаДанные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()

	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТумблерПодписатьИОтправитьПриИзменении(Элемент)
	
	Если Не Объект.ЕстьОтказВПодписи Тогда 
		Объект.ПричинаОтказаВПодписи = "";
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаВПодписиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОснДовОргСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура Титул1ПриИзменении(Элемент)
	ОбновитьДанныеФормы();
КонецПроцедуры
